source/_posts/2011-05-22-microframeworks-and-the-web-state.org
#+STARTUP: showall hidestars indent
#+LINK: twitter http://twitter.com/
#+LINK: mdn     https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/
#+BEGIN_HTML
---
layout: post
title:  Microframeworks and the state of the web
snip:   An in-depth look at both sides of the same coin.
---
#+END_HTML


Micro-"/frameworks/"[fn:1] have been quite a hot topic lately on the
JavaScript community. And by /hot/, I mean that it has lead to some
pretty "heated" discussion (either good ones and "bad" ones), and some
[[http://allyoucanleet.com/2011/05/09/microlibs-the-fud-challenge/][pretty interesting]] [[http://tomdale.net/2011/05/an-uphill-battle/][replies]].

But what's all this fuzz about? Well, the /microlibs/ introduce a shift
from the monolithic libraries (think [[http://jquery.com/][jQuery]], [[http://www.prototypejs.org/][Prototype]], etc), to
self-contained and "modular" ones.

In this post I'll try to explain what's good and bad about either approaches,
delve a little on modular design and sum up what I think that's wrong with most
JS libs, and where we should go from here.


*Note:*
#+BEGIN_QUOTE
I'm going to use *microlibs* thorough this article to refer to what
people call micro-"frameworks"[fn:1] as I think the name fits better
what they actually are.
#+END_QUOTE

* What's wrong with JS frameworks

So you have a new web app to develop, and you're looking for some
building blocks because you don't want to write everything from the
scratch?

Toughest luck, my dear.

Welcome to the "Reproducing desktop's UI toolkit mess in the JavaScript
world" show, only worse. A thousand times worse!


** 1. Feature bloat

If you take [[http://jquery.com/][jQuery]], which weights around 230kb (31kb minified AND
gzipped), you will get all the following goodies out of the box:

 - CSS Selector engine
 - DOM abstraction API
 - Deferreds
 - Ajax/XMLHttpRequest abstractions
 - JSONP
 - CSS helpers
 - Animation/Effects
 - Event abstraction
 - Some other small utilities to fill in some standard lib "gaps"
 - Lots of cross-browser hacks

That is, obviously, overwhelming. People usually don't use all of the
features the library provide, and the overhead of this "dead code" feels
even larger because you have tons of them.

The problems are also solved at a reduced scope, as you'd otherwise have
an unwielding codebase/filesize. For example, the effects included in
jQuery only cover the most basic use-cases, whereas other features have
a lot more of coverage — DOM abstraction.


** 2. Large filesize

Having more code equals having a larger filesize, which is a
problem in web apps because you'll be sending a lot of dead code over
the wire.

This is bad from both the end-user's perspective: pages will take more
time to load, and this hurts a good user experience. No one likes
waiting 2 minutes to see a web site.

And from an efficiency's perspective. You should be very worried about
sending lots of code that will never be used, sir. Seriously.


** 3. Higher learning curve

As you have more features, you'll take longer to master them. This is
not really that much of a problem on the end-user dev, because you would
probably have to learn the same amount of things by stacking lots of
small libraries together.

However, the thing is that it'll take far more time to understand all
the implications of the source code to extend it. Whereas with a simpler
and focused library, it would be quite straight forward.


** 4. Framework-centric code

But all these minor annoyances aside, there's one big issue with the way
most JavaScript frameworks are designed: they encourage you to write
Framework-centric code.

Want to write a date handling library? You should tie the core workings
to the jQuery's DOM manipulation functions. What about a library that
abstracts browser storage? TIE IT TO THE FRAMEWORK'S DOM HANDLING LIKE A
BOSS!

Mind you, the browser is not just about the DOM, or a framework. Writing
framework-centric code when your library does NOT extend on the problem
the framework is trying to solve is a silly thing.

The community can't benefit from your contribution as a whole because
they can't include the DOM framework you're using in their
projects. Either because doubling the overhead with code that solves the
same problem should warrant you a death sentence, and because mixing DOM
libraries may break everything in some cases (Prototype + jQuery, for
example).


* Microlibs to the rescue!

As a response to that, wild microlibs appeared. The main design goal of
these libraries is to focus on doing just a single thing — and doing
that well, while also "doing the simplest thing that could possibly
work".

As such, there's little to no overlap on the features offered from one
microlib to another (given they don't try to solve the same problem, of
course) and you get only what you really need. No more, no less.

In fact, microlibs would fit the [[http://en.wikipedia.org/wiki/Unix_philosophy][Unix philosophy]] quite well (the
text streams aside, usually):

#+BEGIN_QUOTE
Write programs that do one thing and do it well. Write programs to
work together. Write programs to handle text streams, because that is
a universal interface.
#+END_QUOTE

* ...but microlibs are broken too

Reality is a bit harsh, though. There are a few problems with the
*current state* of microlibs, both because they're pretty new and
because somehow this whole size-limit thing has gotten quite messed up.

Some of these problems are quite a show stopper. 


** 1. Lack of documentation

Documentation is good and shouldn't be overlooked. If you want people to
use your code, you should tell them how they should use it. No, dumping
a weird API reference on a ~README~ file won't cut it. Random words
scrawled over the source won't either.

I'm talking about good documentation on the library btw, not just some
API reference. And most microlibs I know (including my [[http://github.com/killdream/ekho][Ekho]] lib)
have no examples, no use cases, no how to get started, no anything!

But there are worse cases (imo). All [[twitter:ded][@ded]]'s libraries have almost
no comments on the source code, and rely rather on dumping a little of
introductory text on an obscure ~README.md~ file.

Mind you, I want to know what are the purposes and implications of using
some function if I'm going to extend the library. I don't want to shoot
myself on the foot by accidentally calling a function that happens to
have side-effects which are not apparent from reading the function
alone.


