_posts/2011-05-22-microframeworks-and-the-web-state.html
---
layout: post
title:  Microframeworks and the state of the web
snip:   An in-depth look at both sides of the same coin.
---


<p>
Micro-"<i>frameworks</i>"<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup> have been quite a hot topic lately on the
JavaScript community. And by <i>hot</i>, I mean that it has lead to some
pretty "heated" discussion (either good ones and "bad" ones), and some
<a href="http://allyoucanleet.com/2011/05/09/microlibs-the-fud-challenge/">pretty interesting</a> <a href="http://tomdale.net/2011/05/an-uphill-battle/">replies</a>.
</p>
<p>
But what's all this fuzz about? Well, the <i>microlibs</i> introduce a shift
from the monolithic libraries (think <a href="http://jquery.com/">jQuery</a>, <a href="http://www.prototypejs.org/">Prototype</a>, etc), to
self-contained and "modular" ones.
</p>
<p>
In this post I'll try to explain what's good and bad about either approaches,
delve a little on modular design and sum up what I think that's wrong with most
JS libs, and where we should go from here.
</p>

<p>
<b>Note:</b>
</p><blockquote>

<p>I'm going to use <b>microlibs</b> thorough this article to refer to what
people call micro-"frameworks"<sup><a class="footref" name="fnr.1.2" href="#fn.1">1</a></sup> as I think the name fits better
what they actually are.
</p>
</blockquote>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">What's wrong with JS frameworks </a>
<ul>
<li><a href="#sec-1-1">1. Feature bloat </a></li>
<li><a href="#sec-1-2">2. Large filesize </a></li>
<li><a href="#sec-1-3">3. Higher learning curve </a></li>
<li><a href="#sec-1-4">4. Framework-centric code </a></li>
</ul>
</li>
<li><a href="#sec-2">Microlibs to the rescue! </a></li>
<li><a href="#sec-3">&hellip;but microlibs are broken too </a>
<ul>
<li><a href="#sec-3-1">1. Lack of documentation </a></li>
<li><a href="#sec-3-2">2. Lack of tests </a></li>
<li><a href="#sec-3-3">3. Small community </a></li>
<li><a href="#sec-3-4">4. Trying to solve problems they're not meant to </a></li>
<li><a href="#sec-3-5">5. API inconsistencies </a></li>
<li><a href="#sec-3-6">6. Dependency hell </a></li>
<li><a href="#sec-3-7">7. Focus on arbitrary filesize </a></li>
</ul>
</li>
<li><a href="#sec-4">What can we do? </a>
<ul>
<li><a href="#sec-4-1">A new design philosophy </a></li>
<li><a href="#sec-4-2">Problems with this philosophy </a></li>
</ul>
</li>
<li><a href="#sec-5">Wrapping it up </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">What's wrong with JS frameworks </h2>
<div class="outline-text-2" id="text-1">


<p>
So you have a new web app to develop, and you're looking for some
building blocks because you don't want to write everything from the
scratch?
</p>
<p>
Toughest luck, my dear.
</p>
<p>
Welcome to the "Reproducing desktop's UI toolkit mess in the JavaScript
world" show, only worse. A thousand times worse!
</p>


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">1. Feature bloat </h3>
<div class="outline-text-3" id="text-1-1">


<p>
If you take <a href="http://jquery.com/">jQuery</a>, which weights around 230kb (31kb minified AND
gzipped), you will get all the following goodies out of the box:
</p>
<ul>
<li>CSS Selector engine
</li>
<li>DOM abstraction API
</li>
<li>Deferreds
</li>
<li>Ajax/XMLHttpRequest abstractions
</li>
<li>JSONP
</li>
<li>CSS helpers
</li>
<li>Animation/Effects
</li>
<li>Event abstraction
</li>
<li>Some other small utilities to fill in some standard lib "gaps"
</li>
<li>Lots of cross-browser hacks
</li>
</ul>


<p>
That is, obviously, overwhelming. People usually don't use all of the
features the library provide, and the overhead of this "dead code" feels
even larger because you have tons of them.
</p>
<p>
The problems are also solved at a reduced scope, as you'd otherwise have
an unwielding codebase/filesize. For example, the effects included in
jQuery only cover the most basic use-cases, whereas other features have
a lot more of coverage — DOM abstraction.
</p>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">2. Large filesize </h3>
<div class="outline-text-3" id="text-1-2">


<p>
Having more code equals having a larger filesize, which is a
problem in web apps because you'll be sending a lot of dead code over
the wire.
</p>
<p>
This is bad from both the end-user's perspective: pages will take more
time to load, and this hurts a good user experience. No one likes
waiting 2 minutes to see a web site.
</p>
<p>
And from an efficiency's perspective. You should be very worried about
sending lots of code that will never be used, sir. Seriously.
</p>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">3. Higher learning curve </h3>
<div class="outline-text-3" id="text-1-3">


<p>
As you have more features, you'll take longer to master them. This is
not really that much of a problem on the end-user dev, because you would
probably have to learn the same amount of things by stacking lots of
small libraries together.
</p>
<p>
However, the thing is that it'll take far more time to understand all
the implications of the source code to extend it. Whereas with a simpler
and focused library, it would be quite straight forward.
</p>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">4. Framework-centric code </h3>
<div class="outline-text-3" id="text-1-4">


<p>
But all these minor annoyances aside, there's one big issue with the way
most JavaScript frameworks are designed: they encourage you to write
Framework-centric code.
</p>
<p>
Want to write a date handling library? You should tie the core workings
to the jQuery's DOM manipulation functions. What about a library that
abstracts browser storage? TIE IT TO THE FRAMEWORK'S DOM HANDLING LIKE A
BOSS!
</p>
<p>
Mind you, the browser is not just about the DOM, or a framework. Writing
framework-centric code when your library does NOT extend on the problem
the framework is trying to solve is a silly thing.
</p>
<p>
The community can't benefit from your contribution as a whole because
they can't include the DOM framework you're using in their
projects. Either because doubling the overhead with code that solves the
same problem should warrant you a death sentence, and because mixing DOM
libraries may break everything in some cases (Prototype + jQuery, for
example).
</p>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Microlibs to the rescue! </h2>
<div class="outline-text-2" id="text-2">


<p>
As a response to that, wild microlibs appeared. The main design goal of
these libraries is to focus on doing just a single thing — and doing
that well, while also "doing the simplest thing that could possibly
work".
</p>
<p>
As such, there's little to no overlap on the features offered from one
microlib to another (given they don't try to solve the same problem, of
course) and you get only what you really need. No more, no less.
</p>
<p>
In fact, microlibs would fit the <a href="http://en.wikipedia.org/wiki/Unix_philosophy">Unix philosophy</a> quite well (the
text streams aside, usually):
</p>
<blockquote>

<p>Write programs that do one thing and do it well. Write programs to
work together. Write programs to handle text streams, because that is
a universal interface.
</p>
</blockquote>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">&hellip;but microlibs are broken too </h2>
<div class="outline-text-2" id="text-3">


<p>
Reality is a bit harsh, though. There are a few problems with the
<b>current state</b> of microlibs, both because they're pretty new and
because somehow this whole size-limit thing has gotten quite messed up.
</p>
<p>
Some of these problems are quite a show stopper. 
</p>


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">1. Lack of documentation </h3>
<div class="outline-text-3" id="text-3-1">


<p>
Documentation is good and shouldn't be overlooked. If you want people to
use your code, you should tell them how they should use it. No, dumping
a weird API reference on a <code>README</code> file won't cut it. Random words
scrawled over the source won't either.
</p>
<p>
I'm talking about good documentation on the library btw, not just some
API reference. And most microlibs I know (including my <a href="http://github.com/killdream/ekho">Ekho</a> lib)
have no examples, no use cases, no how to get started, no anything!
</p>
<p>
But there are worse cases (imo). All <a href="http://twitter.com/ded">@ded</a>'s libraries have almost
no comments on the source code, and rely rather on dumping a little of
introductory text on an obscure <code>README.md</code> file.
</p>
<p>
Mind you, I want to know what are the purposes and implications of using
some function if I'm going to extend the library. I don't want to shoot
myself on the foot by accidentally calling a function that happens to
have side-effects which are not apparent from reading the function
alone.
</p>

</div>

</div>
