source/_posts/2011-05-22-microframeworks-and-the-web-state.org
** 2. Lack of tests

Some libraries do have a small amount of test cases, but as
[[twitter:jDalton][@jDalton]] showed on his [[http://allyoucanleet.com/2011/05/09/microlibs-the-fud-challenge/][screen cast]], some don't really
have that good of a coverage.

Some libraries ([[http://github.com/killdream/ekho][Ekho]]) have absolutely NO unit tests, which is something you
should find outrageous[fn:2] (and, maybe, help fixing).


** 3. Small community

This is more related to how recent all these libraries are. They don't
have a large user base like the monolithic frameworks. So it may be
quite more difficult to find an answer to problems you're facing.

It's also likely that the library will have problems that people using
more mature and larger frameworks have already reported. And these would
take a bit to fix as well.


** 4. Trying to solve problems they're not meant to

According to the buzz on the internets, microlibs are supposed to do
/only one thing and do it well™/, but in practice, that's not
true. Almost all of these libraries will provide fallbacks for
features that are not related to the design goals of the library,
and worse, for features that are described in the [[http://es5.github.com][ECMAScript 5]]
specs.

Yes, I'm looking at all of the libraries that implement
[[mdn:Array/indexOf][Array#indexOf]], [[mdn:Array/filter][Array#filter]], [[mdn:Function/bind][Function#bind]] and such
fallbacks, when the library tries to solve an entire different problem.

This creates two problems. The first is that now instead of having dead
code, you have *duplicated code*. It's even worse if you're only
targeting platforms which are ES5-compliant, because now you have
*duplicated dead code*.

The second problem is that some of these libraries implement things that
don't conform with the specs. And I'm not too keen on having 20
different implementations of [[mdn:Array/indexOf][Array#indexOf]] which don't work for
sparse arrays, thank you.


** 5. API inconsistencies

You can't expect to get API consistencies when using libraries from 10
different authors if they're not designed to work together, which you'd
get for free on JavaScript frameworks (or would you?[fn:3]). 

This can be really bad when you need to have two libraries to work
together, say a CSS selector engine and a DOM manipulation library. Of
course you can abstract all of them and create a DSL on top of them,
just as you could read a minified source rather than a properly
commented one...


** 6. Dependency hell

Browsers still don't offer native support for modules, although it's
[[http://wiki.ecmascript.org/doku.php?id%3Dharmony:modules][being discussed for ES.Next]], nor can you use ~jspm install microlib~ and
have all the dependencies sorted out nicely for you.

The thing is that using lots of small libraries will make your building
and testing process quite more complex. Where you had to include a
simple script tag to load everything you need, you'll need to include
loads of them (in the right order too), or have something that
automagically concatenates those files in the right order.

Either way, it's quite some hassle.


** 7. Focus on arbitrary filesize

Having a soft-limit for filesize isn't necessarily a bad thing. It helps
you to know when you're over-engineering things. However, 
not all the problems are the same that you can happily have a
[[http://tomdale.net/2011/05/an-uphill-battle/][5kb limit for everynyan]].

With the microlibs, things have somehow gotten screwed up and the focus
that should be into "*reducing the scope of the library for modularity*"
(think minimalism), turned into a battle for who could fit an entire DOM
library in a tweet.

I find this whole premature and reckless optimisation for filesize
pretty stupid, of course. [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-7.html][As Sussman says]]:

#+BEGIN_QUOTE
Programs must be written for people to read, and only incidentally for
machines to execute.
#+END_QUOTE

Programs should also be written for correctness and to effectively solve
the problems they propose to solve, but I guess everyone knows that
already...


* What can we do?

So, large and bloated frameworks are a bad idea for web apps, but the
current state of microlibs is also pretty bad. That's no fun, and
definitely not good for the community, right?

The obvious answer to these problems is to focus on writing modular
libraries. And when I say /modular/, I'm referring to libraries that fit
the Unix philosophy.

They should be designed to solve just one problem, and solve it well, so
people can decide exactly which problems they want to solve instead of
getting a large black box that tries to solve everything.

They should also be designed to work nicely with other libraries,
otherwise what's the point in having modular stuff anyways? You'll most
likely never have to solve just a single problem when writing a web
app.


** A new design philosophy

In fact, we can summarise it nicely in a list of few points to keep in
mind when designing a library. Mostly stolen from Eric Raymond's The Art
of Unix Programming book:

- Modularity    ::
  Write simple parts connected by clean interfaces.

- Composition   ::
  Design libraries to be connected to other libraries.

- Simplicity    ::
  Design for simplicity; add complexity only where you must.

- Correctness   ::
  If it doesn't *fully* solves the problem it's designed to solve, it's
  broken.

- Lazyness      ::
  Don't try to solve what's already solved; stop writing broken ES5
  fallbacks.

- Parsimony     ::
  Write big libraries only when it's clear by demonstration that nothing
  else will do.

- Optimisation  ::
  Prototype before polishing. Get it working before you optimise it (be
  it for size, speed or anything else).

- Extensibility ::
  Design for the future, because it will be here sooner than you think
  (modules are a good thing, and they'll be added to the language!)


