_posts/2011-05-22-microframeworks-and-the-web-state.html

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">2. Lack of tests </h3>
<div class="outline-text-3" id="text-3-2">


<p>
Some libraries do have a small amount of test cases, but as
<a href="http://twitter.com/jDalton">@jDalton</a> showed on his <a href="http://allyoucanleet.com/2011/05/09/microlibs-the-fud-challenge/">screen cast</a>, some don't really
have that good of a coverage.
</p>
<p>
Some libraries (<a href="http://github.com/killdream/ekho">Ekho</a>) have absolutely NO unit tests, which is something you
should find outrageous<sup><a class="footref" name="fnr.2" href="#fn.2">2</a></sup> (and, maybe, help fixing).
</p>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">3. Small community </h3>
<div class="outline-text-3" id="text-3-3">


<p>
This is more related to how recent all these libraries are. They don't
have a large user base like the monolithic frameworks. So it may be
quite more difficult to find an answer to problems you're facing.
</p>
<p>
It's also likely that the library will have problems that people using
more mature and larger frameworks have already reported. And these would
take a bit to fix as well.
</p>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">4. Trying to solve problems they're not meant to </h3>
<div class="outline-text-3" id="text-3-4">


<p>
According to the buzz on the internets, microlibs are supposed to do
<i>only one thing and do it well™</i>, but in practice, that's not
true. Almost all of these libraries will provide fallbacks for
features that are not related to the design goals of the library,
and worse, for features that are described in the <a href="http://es5.github.com">ECMAScript 5</a>
specs.
</p>
<p>
Yes, I'm looking at all of the libraries that implement
<a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Array/indexOf">Array#indexOf</a>, <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Array/filter">Array#filter</a>, <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Function/bind">Function#bind</a> and such
fallbacks, when the library tries to solve an entire different problem.
</p>
<p>
This creates two problems. The first is that now instead of having dead
code, you have <b>duplicated code</b>. It's even worse if you're only
targeting platforms which are ES5-compliant, because now you have
<b>duplicated dead code</b>.
</p>
<p>
The second problem is that some of these libraries implement things that
don't conform with the specs. And I'm not too keen on having 20
different implementations of <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Array/indexOf">Array#indexOf</a> which don't work for
sparse arrays, thank you.
</p>

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">5. API inconsistencies </h3>
<div class="outline-text-3" id="text-3-5">


<p>
You can't expect to get API consistencies when using libraries from 10
different authors if they're not designed to work together, which you'd
get for free on JavaScript frameworks (or would you?<sup><a class="footref" name="fnr.3" href="#fn.3">3</a></sup>). 
</p>
<p>
This can be really bad when you need to have two libraries to work
together, say a CSS selector engine and a DOM manipulation library. Of
course you can abstract all of them and create a DSL on top of them,
just as you could read a minified source rather than a properly
commented one&hellip;
</p>

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">6. Dependency hell </h3>
<div class="outline-text-3" id="text-3-6">


<p>
Browsers still don't offer native support for modules, although it's
<a href="http://wiki.ecmascript.org/doku.php?id=harmony:modules">being discussed for ES.Next</a>, nor can you use <code>jspm install microlib</code> and
have all the dependencies sorted out nicely for you.
</p>
<p>
The thing is that using lots of small libraries will make your building
and testing process quite more complex. Where you had to include a
simple script tag to load everything you need, you'll need to include
loads of them (in the right order too), or have something that
automagically concatenates those files in the right order.
</p>
<p>
Either way, it's quite some hassle.
</p>

</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">7. Focus on arbitrary filesize </h3>
<div class="outline-text-3" id="text-3-7">


<p>
Having a soft-limit for filesize isn't necessarily a bad thing. It helps
you to know when you're over-engineering things. However, 
not all the problems are the same that you can happily have a
<a href="http://tomdale.net/2011/05/an-uphill-battle/">5kb limit for everynyan</a>.
</p>
<p>
With the microlibs, things have somehow gotten screwed up and the focus
that should be into "<b>reducing the scope of the library for modularity</b>"
(think minimalism), turned into a battle for who could fit an entire DOM
library in a tweet.
</p>
<p>
I find this whole premature and reckless optimisation for filesize
pretty stupid, of course. <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-7.html">As Sussman says</a>:
</p>
<blockquote>

<p>Programs must be written for people to read, and only incidentally for
machines to execute.
</p>
</blockquote>


<p>
Programs should also be written for correctness and to effectively solve
the problems they propose to solve, but I guess everyone knows that
already&hellip;
</p>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">What can we do? </h2>
<div class="outline-text-2" id="text-4">


<p>
So, large and bloated frameworks are a bad idea for web apps, but the
current state of microlibs is also pretty bad. That's no fun, and
definitely not good for the community, right?
</p>
<p>
The obvious answer to these problems is to focus on writing modular
libraries. And when I say <i>modular</i>, I'm referring to libraries that fit
the Unix philosophy.
</p>
<p>
They should be designed to solve just one problem, and solve it well, so
people can decide exactly which problems they want to solve instead of
getting a large black box that tries to solve everything.
</p>
<p>
They should also be designed to work nicely with other libraries,
otherwise what's the point in having modular stuff anyways? You'll most
likely never have to solve just a single problem when writing a web
app.
</p>


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">A new design philosophy </h3>
<div class="outline-text-3" id="text-4-1">


<p>
In fact, we can summarise it nicely in a list of few points to keep in
mind when designing a library. Mostly stolen from Eric Raymond's The Art
of Unix Programming book:
</p>
<dl>
<dt>Modularity   </dt><dd>
<p>
  Write simple parts connected by clean interfaces.
</p>
</dd>
<dt>Composition  </dt><dd>
<p>
  Design libraries to be connected to other libraries.
</p>
</dd>
<dt>Simplicity   </dt><dd>
<p>
  Design for simplicity; add complexity only where you must.
</p>
</dd>
<dt>Correctness  </dt><dd>
<p>
  If it doesn't <b>fully</b> solves the problem it's designed to solve, it's
  broken.
</p>
</dd>
<dt>Lazyness     </dt><dd>
<p>
  Don't try to solve what's already solved; stop writing broken ES5
  fallbacks.
</p>
</dd>
<dt>Parsimony    </dt><dd>
<p>
  Write big libraries only when it's clear by demonstration that nothing
  else will do.
</p>
</dd>
<dt>Optimisation </dt><dd>
<p>
  Prototype before polishing. Get it working before you optimise it (be
  it for size, speed or anything else).
</p>
</dd>
<dt>Extensibility</dt><dd>
<p>
  Design for the future, because it will be here sooner than you think
  (modules are a good thing, and they'll be added to the language!)
</p></dd>
</dl>

</div>

</div>
