source/_posts/2011-05-22-microframeworks-and-the-web-state.org
** Problems with this philosophy

Obviously, these points are not anything near perfect. And it gets worse
if you take the current state of browser platforms into account. The web
is quite heterogeneous. Even on browsers who do conform with the
standards, you still have some quite funny discrepancies on
the inner workings — and that affects your code.

To make things yet worse, you don't have much things to solve the
dependency hell, aside from writing a custom build tool. And even so,
you'll likely need to download and build a set of different libraries to
get everything working.

This is not exactly my definition of fun.

For this to really work, we'd need a good package manager; like what [[http://github.com/isaacs/npm][npm]]
is to [[http://nodejs.org][Node.js]]. And we would also need either some support for loading
these external modules in a sane way (you do [[http://github.com/killdream/jello][have]] [[http://requirejs.org][some]] [[http://labjs.com][libraries]] [[http://news.ycombinator.com/item?id%3D2300423][for
that]]), rather than having to do with build scripts.


* Wrapping it up

There's no such thing as *one true way*. I don't think modular
libraries/frameworks solve all the problems, but they do address quite
some of the problems we have with the current models of libraries.

And it would be nice having a healthier environment for developing new
awesome apps on the Browser, without having to write everything from
scrath again because the thing you need is only included in another
library, and it uses a framework-centric approach.

All in all, it's something I think would benefit the JavaScript
community as a whole :3


[fn:1] I hate using the term "framework" to refer to libraries with all
       my guts. Seriously, people, is `library` **that** hard to spell?


[fn:2] I'll work on tests and documentation for [[http://github.com/killdream/ekho][Ekho]] and friends when I
       have time to do so. Probably after I finish some of the core
       concepts/early prototypes for [[http://killdream.github.com/orpheos][OrpheOS]]. Until then, considering
       the library a beta release may be a good thing.


[fn:3] I don't think PrototypeJS has a consistent API, for
       example. Though Ruby people might say otherwise, it just strikes
       me as odd if you use ~bindAsEventListener~ and ~gsub~ randomly on
       your API (I would never take a Ruby programmer's word on good API
       design anyways ;P). jQuery's API on the other hand (although I've
       only used a small subset of it for a short time) is just a mess
       of counter-intuitive and poorly-named methods. People should stop
       getting inspired by PHP when designing an API...
