_posts/2011-05-22-microframeworks-and-the-web-state.html

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Problems with this philosophy </h3>
<div class="outline-text-3" id="text-4-2">


<p>
Obviously, these points are not anything near perfect. And it gets worse
if you take the current state of browser platforms into account. The web
is quite heterogeneous. Even on browsers who do conform with the
standards, you still have some quite funny discrepancies on
the inner workings — and that affects your code.
</p>
<p>
To make things yet worse, you don't have much things to solve the
dependency hell, aside from writing a custom build tool. And even so,
you'll likely need to download and build a set of different libraries to
get everything working.
</p>
<p>
This is not exactly my definition of fun.
</p>
<p>
For this to really work, we'd need a good package manager; like what <a href="http://github.com/isaacs/npm">npm</a>
is to <a href="http://nodejs.org">Node.js</a>. And we would also need either some support for loading
these external modules in a sane way (you do <a href="http://github.com/killdream/jello">have</a> <a href="http://requirejs.org">some</a> <a href="http://labjs.com">libraries</a> <a href="http://news.ycombinator.com/item?id=2300423">for that</a>), rather than having to do with build scripts.
</p>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Wrapping it up </h2>
<div class="outline-text-2" id="text-5">


<p>
There's no such thing as <b>one true way</b>. I don't think modular
libraries/frameworks solve all the problems, but they do address quite
some of the problems we have with the current models of libraries.
</p>
<p>
And it would be nice having a healthier environment for developing new
awesome apps on the Browser, without having to write everything from
scrath again because the thing you need is only included in another
library, and it uses a framework-centric approach.
</p>
<p>
All in all, it's something I think would benefit the JavaScript
community as a whole :3
</p>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> I hate using the term "framework" to refer to libraries with all
       my guts. Seriously, people, is `library` **that** hard to spell?
</p>

<p class="footnote"><sup><a class="footnum" name="fn.2" href="#fnr.2">2</a></sup> I'll work on tests and documentation for <a href="http://github.com/killdream/ekho">Ekho</a> and friends when I
       have time to do so. Probably after I finish some of the core
       concepts/early prototypes for <a href="http://killdream.github.com/orpheos">OrpheOS</a>. Until then, considering
       the library a beta release may be a good thing.
</p>

<p class="footnote"><sup><a class="footnum" name="fn.3" href="#fnr.3">3</a></sup> I don't think PrototypeJS has a consistent API, for
       example. Though Ruby people might say otherwise, it just strikes
       me as odd if you use <code>bindAsEventListener</code> and <code>gsub</code> randomly on
       your API (I would never take a Ruby programmer's word on good API
       design anyways ;P). jQuery's API on the other hand (although I've
       only used a small subset of it for a short time) is just a mess
       of counter-intuitive and poorly-named methods. People should stop
       getting inspired by PHP when designing an API&hellip;
</p>
</div>
</div>

</div>
</div>
